docs/blogroll.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blogroll</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"href="resources/org.css"type="text/css" /><header><a href="index.html">Home</a>&emsp;<a href="about.html">About Me</a>&emsp;<a href="https://github.com/abdrysdale/abdrysdale.github.io">Source</a>&emsp;<a href="sitemap.html">Sitemap</a>&emsp;<a href="feed.xml">RSS</a></header>
<link rel="icon" type="image/x-icon" href="/resources/favicon.jpeg">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Blogroll</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgac50b97">Meadowhawk</a></li>
<li><a href="#org0d96a05">Ruslan</a></li>
<li><a href="#org596dea2">Dennis Ogbe's Blog</a></li>
<li><a href="#org95a711f">Sacha Chau's Blog</a></li>
<li><a href="#org3f3ed59">Freya Vie</a></li>
<li><a href="#org8ab7f40">Jan's Garden</a></li>
<li><a href="#orge41788b">Brett Mullins</a></li>
<li><a href="#orgadf94c4">Marius Masalar</a></li>
<li><a href="#orgfb6b217">Neil Grogan</a></li>
<li><a href="#orgeccb8df">Ryan Himmelwright</a></li>
<li><a href="#org41b319f">Galen Cuthbertson</a></li>
</ul>
</div>
</div>
<p>
This is a <a href="https://blogroll.org/">blogroll</a> page - a list of blogs I follow in no particular order. I've included the blog and with some information lifted from the blog's about page.
</p>

<div id="outline-container-orgac50b97" class="outline-2">
<h2 id="orgac50b97"><a href="https://blog.meadowhawk.xyz/">Meadowhawk</a></h2>
<div class="outline-text-2" id="text-orgac50b97">
<blockquote>
<p>
[Y]ou're going to find all my notes on Making, hacking, P2P and
decentralization here. I embrace independence, self reliance and cultivating small
communities. Decentralization is the only option left to us who are fighting this corporate
dystopia, join me in independence!
</p>
</blockquote>
</div>
</div>


<div id="outline-container-org0d96a05" class="outline-2">
<h2 id="org0d96a05"><a href="https://codelearn.me">Ruslan</a></h2>
<div class="outline-text-2" id="text-org0d96a05">
<blockquote>
<p>
I'm a long time Software Engineer primarily aiming web technologies.
</p>

<p>
I've created this site to keep every kind of notes I consider useful and I really hope these
notes may be helpful for other people as well.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org596dea2" class="outline-2">
<h2 id="org596dea2"><a href="https://ogbe.net/blog/">Dennis Ogbe's Blog</a></h2>
<div class="outline-text-2" id="text-org596dea2">
<blockquote>
<p>
Dennis O. Ogbe (S'13, M'20) is a member of the Reprogrammable Signal Processing group at NASA's Jet Propulsion Laboratory in Pasadena, CA. Prior to joining JPL, he was a postdoctoral associate in the Bradley Department of Electrical and Computer Engineering at Virginia Tech in Arlington, VA, followed by a stint as a software-defined radio engineer at Lynk in Falls Church, VA. He holds a B.S. in electrical engineering from Tennessee Technological University and a Ph.D. in electrical engineering from Purdue University. His research interests are in the fields of communication theory, signal processing, computer engineering, and their application to aerospace engineering problems.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org95a711f" class="outline-2">
<h2 id="org95a711f"><a href="http://sachachua.com/">Sacha Chau's Blog</a></h2>
<div class="outline-text-2" id="text-org95a711f">
<blockquote>
<p>
I can't remember everything. In fact, anything past the last week gets pretty fuzzy. That's why I try to share as much as I can through this personal blog. You'll find notes about Emacs, parenting, sketchnoting, visual book reviews, self-tracking, blogging, life&#x2026; whatever I'm learning about or whatever I can help other people learn.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org3f3ed59" class="outline-2">
<h2 id="org3f3ed59"><a href="https://freyavie.blog/about/">Freya Vie</a></h2>
<div class="outline-text-2" id="text-org3f3ed59">
<blockquote>
<p>
I am a mother of two preschoolers and work office hours in the government sector.
</p>

<p>
I've been writing since 2006 to process and reflect on my daily life - what I did, observed,
overheard, or learned. Writing is crucial to me - it keeps me grounded, makes me happy,
and allows me to connect with others personally.
</p>
</blockquote>
</div>
</div>


<div id="outline-container-org8ab7f40" class="outline-2">
<h2 id="org8ab7f40"><a href="https://jan.systems/">Jan's Garden</a></h2>
<div class="outline-text-2" id="text-org8ab7f40">
<blockquote>
<p>
On this personal website you may find things related to computers and software, games
of all kinds but mostly tabletop and role-playing, electronics, music, language learning and
linguistics. I'm not big on writing long-form stuff or essays, but I sometimes like to jot down
some short ideas or experiences. I created this site to lower the barrier to entry and make
it easier for myself to just write.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orge41788b" class="outline-2">
<h2 id="orge41788b"><a href="https://bcmullins.github.io/">Brett Mullins</a></h2>
<div class="outline-text-2" id="text-orge41788b">
<blockquote>
<p>
I am a researcher and graduate student at UMass Amherst working with Dan Sheldon and
Gerome Miklau. Before this, I was a Data Scientist at Allstate, an affiliate researcher at the
Fiscal Research Center at Georgia State University, and studied mathematics and logic at
Miami University in Oxford, Ohio.
</p>
</blockquote>
</div>
</div>


<div id="outline-container-orgadf94c4" class="outline-2">
<h2 id="orgadf94c4"><a href="https://marius.ink/">Marius Masalar</a></h2>
<div class="outline-text-2" id="text-orgadf94c4">
<blockquote>
<p>
By day, I work at 1Password. This is where I write about
seeking healthier, more thoughtful relationships with technology.
</p>
</blockquote>
</div>
</div>


<div id="outline-container-orgfb6b217" class="outline-2">
<h2 id="orgfb6b217"><a href="https://www.neilgrogan.com/">Neil Grogan</a></h2>
<div class="outline-text-2" id="text-orgfb6b217">
<blockquote>
<p>
Software Engineering Manager at Ericsson in Athlone, Ireland, managing teams in Software Development Kits (SDKs) for Encsson Intelligent Automation Platform (EIAP). Before that, I was managing JEE Platform, User Interface SDK and 5G Topology teams in Ericsson Network Manager.
</p>
</blockquote>
</div>
</div>


<div id="outline-container-orgeccb8df" class="outline-2">
<h2 id="orgeccb8df"><a href="https://ryan.himmelwright.net/about/">Ryan Himmelwright</a></h2>
<div class="outline-text-2" id="text-orgeccb8df">
<blockquote>
<p>
I'm a 30-something dad, husband, and all-around nerd living in Durham, NC (USA). My hobbies span just about anything I come in contact with, but some of the most prominent ones over the years have been technology, writing, music, reading TTRPGs, hiking, and swimming (I competitively swam from the age of 8, through college). I also enjoy learning about permaculture gardening, sustainability, urban planning, and similar topics.
</p>
</blockquote>
</div>
</div>


<div id="outline-container-org41b319f" class="outline-2">
<h2 id="org41b319f"><a href="https://galen.me/">Galen Cuthbertson</a></h2>
<div class="outline-text-2" id="text-org41b319f">
<blockquote>
<p>
About Me
I build tools &amp; toys to help understand human culture.
I'm doing a PhD at the Australian National University, where I'm studying
complex machine learning models (esp. large language models), and
whether those models are (or can be) meaningfully 'knowledge-producing' in the social sciences.
I generally want humans to
flourish far into the future, and
not destroy ourselves in the process of developing powerful new technologies (hence the PhD).
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-09-08 Mon 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
